#include <stdio.h> // бібліотека стандартного вводу-виводу C
#include <math.h>  // бібліотека математичних функцій в C

int main()
{
    float x = 0.0001f; //визначаємо дійсну (одинарної точності) змінну 'x'
    double x1 = 0.0001; //визначаємо дійсну (подвійної точності) змінну 'x1'
    double x2 = 1e-04;
    printf("\nx=%f x1=%.51f x2=%g\n", x, x1, x2);

    double x3 = 24.33E5; //визначаємо дійсну (подвійної точності) змінну 'x3'
    printf("x3=%.2lf\n", x3);

    long double x_pi = 3.14159265358979323846264338327950288419716939937510L;
    printf("x_pi=%.50Lf\n", x_pi);
    long double x_pi2 = M_PI; // використання константи з math.h
    printf("x_pi=%.50Lf\n", x_pi2);
    double e1 = exp(1.0); // обчислення експоненти M_E
    printf("e1=%.21f\n", e1);

    double s1 = sqrt(5); // обчислення квадратного кореня
    printf("sqrt(5)=%.21f\n", s1);

    double s2 = log(100); // обчислення квадратного кореня
    printf("log(100)=%.21f\n", s2);

}